test.yml
config:
  target: https://xeno-canto.org/explore/api
  phases:
    - duration: 2
      arrivalRate: 4
      name: Artillery First Test
plugins:
  ensure: {}
ensure:
  thresholds:
    - response_time.p95: 1500  
    - request_rate: 4  
    - response_time.max: 800   
  conditions:
      - expression: vusers.failed == 0  
scenarios:
    - name: Getting a resource
      flow:
        - get:
            url: "{{ target }}/get"
            headers:
              User-Agent: "Artillery"
        - post:
            url: "{{ target }}/post"
            json:
            username: "Test User"
            password: "Temp Password"
capture:
    - json: "$.json"
      as: "request_body"
    - json: "$.headers.Host"
      as: "host"
payload:
  path: "./ARTILLERY/keywords.csv"
  fields:
    - username
    - password